# CurtainGridLine Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainGridLine Class
Members See Also
---
Represents a CurtainGridLine within Autodesk Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class CurtainGridLine : HostObject
```

Visual Basic
---
```text
Public Class CurtainGridLine _
	Inherits HostObject
```

Visual C++
---
```text
public ref class CurtainGridLine : public HostObject
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..HostObject Autodesk.Revit.DB..::..CurtainGridLine
# See Also
CurtainGridLine Members
Autodesk.Revit.DB Namespace